tap "nats-io/nats-tools"
tap "noahgorstein/tap"
brew "a2ps"
brew "libpng"
brew "libgit2"
brew "bat"
brew "btop"
brew "cmake"
brew "ctop"
brew "doctest"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gcc"
brew "ghostscript"
brew "python@3.13"
brew "glances"
brew "glow"
brew "go"
brew "graphviz"
brew "ncurses"
brew "htop"
brew "hunspell"
brew "lazydocker"
brew "lazygit"
brew "libvirt"
brew "luarocks"
brew "mactop"
brew "markdownlint-cli2"
brew "mdv"
brew "mpv"
brew "neovim"
brew "notcurses"
brew "openjdk@17"
brew "openjdk@21"
brew "pandoc"
brew "podman"
brew "podman-tui"
brew "qemu"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "semgrep"
brew "stow"
brew "tldr"
brew "tmux"
brew "unzip"
brew "watch"
brew "yazi"
brew "zig"
brew "nats-io/nats-tools/nats"
brew "noahgorstein/tap/jqp"
cask "brave-browser"
cask "container"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "goland"
cask "google-chrome"
cask "intellij-idea"
cask "kitty"
cask "mullvad-vpn"
cask "podman-desktop"
cask "raycast"
cask "telegram"
cask "time-out"
cask "transmission"
cask "vagrant"
