tap "homebrew/bundle"
brew "libpng"
brew "bat"
brew "btop"
brew "ctop"
brew "fastfetch"
brew "fd"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gcc"
brew "glances"
brew "go"
brew "htop"
brew "hunspell"
brew "lazydocker"
brew "lazygit"
brew "luarocks"
brew "mactop"
brew "markdownlint-cli2"
brew "mdv"
brew "mpv"
brew "neovim"
brew "notcurses"
brew "openjdk@17"
brew "openjdk@21"
brew "ripgrep"
brew "rust"
brew "semgrep"
brew "stow"
brew "tldr"
brew "tmux"
brew "unzip"
brew "yazi"
brew "zig"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "ghostty"
cask "goland"
cask "google-chrome"
cask "intellij-idea"
cask "kitty"
cask "raycast"
