tap "hashicorp/tap"
tap "nats-io/nats-tools"
tap "nikitabobko/tap"
tap "noahgorstein/tap"

brew "a2ps"
brew "azure-cli"
brew "bat"
brew "btop"
brew "caddy"
brew "cmake"
brew "container"
brew "ctop"
brew "doctest"
brew "entr"
brew "eza"
brew "fastfetch"
brew "fd"
brew "feh"
brew "ffmpeg"
brew "fortune"
brew "fzf"
brew "gcc"
brew "ghostscript"
brew "git-filter-repo"
brew "glances"
brew "glow"
brew "go"
brew "golangci-lint"
brew "graphviz"
brew "hashicorp/tap/terraform"
brew "helm"
brew "htop"
brew "hunspell"
brew "imagemagick"
brew "jqp"
brew "julia"
brew "kubernetes-cli"
brew "lazydocker"
brew "lazygit"
brew "libgit2"
brew "libpng"
brew "libvirt"
brew "libvirt", restart_service: :changed
brew "lua-language-server"
brew "luarocks"
brew "mactop"
brew "markdownlint-cli2"
brew "mdv"
brew "mermaid-cli"
brew "mole"
brew "mplayer"
brew "mpv"
brew "nats-io/nats-tools/nats"
brew "ncurses"
brew "neovim"
brew "neovim", args: ["HEAD"]
brew "nmap"
brew "notcurses"
brew "ollama"
brew "opencode"
brew "openjdk@17"
brew "openjdk@21"
brew "pandoc"
brew "podman-tui"
brew "podman"
brew "python@3.13"
brew "qemu"
brew "ripgrep"
brew "rsync"
brew "rust"
brew "rustup"
brew "semgrep"
brew "stow"
brew "tectonic"
brew "tldr"
brew "tmux"
brew "transmission-cli"
brew "tree-sitter-cli"
brew "unzip"
brew "uv"
brew "watch"
brew "wget"
brew "yazi"
brew "zig"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "alacritty"
cask "brave-browser"
cask "container"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "ghostty"
cask "goland"
cask "google-chrome"
cask "intellij-idea"
cask "kitty"
cask "maccy"
cask "mullvad-vpn"
cask "nikitabobko/tap/aerospace"
cask "podman-desktop"
cask "raycast"
cask "telegram"
cask "time-out"
cask "tor-browser"
cask "transmission"
cask "vagrant"

go "github.com/air-verse/air"
go "github.com/caelifer/dups"
go "github.com/caelifer/tree"
go "github.com/containers/podman-tui"
go "github.com/incu6us/goimports-reviser/v3"
go "github.com/itchyny/gojq/cmd/gojq"
go "github.com/oapi-codegen/oapi-codegen/v2/cmd/oapi-codegen"
go "github.com/sqs/goreturns"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/go/analysis/passes/modernize/cmd/modernize"

